betfair/templates/aus/BFExchangeService.cancelBets.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/exchange/v5/'
xmlns:ns1='http://www.betfair.com/publicapi/v5/BFExchangeService/'>
<SOAP-ENV:Body>
<ns1:cancelBets>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<bets>
<ns2:CancelBets>
<betId>0</betId>
</ns2:CancelBets>
<ns2:CancelBets>
<betId>0</betId>
</ns2:CancelBets>
</bets>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:cancelBets>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
